Horion0415/xiaozhi-esp32/components/ir_remote_control/test_apps/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c5"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_WIFI_SSID="TP-LINK_Liu"
CONFIG_EXAMPLE_WIFI_PASSWORD="11112222"
CONFIG_EXAMPLE_CONNECT_IPV6=n
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_IR_SERVER_URL="https://srv.irext.net/irext-server"
CONFIG_IR_APP_KEY="80c87aaab5676d488a83a929c5b772bb"
CONFIG_IR_APP_SECRET="01ab16a3fae13fb6a25e169227f14222"
